{"config": [{"config": {"bias_regularizer": null, "activation": "relu", "use_bias": true, "trainable": true, "batch_input_shape": [null, 4], "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 6, "dtype": "float32", "activity_regularizer": null, "name": "hidden1", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "activation": "relu", "use_bias": true, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 7, "activity_regularizer": null, "name": "hidden2", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "activation": "softmax", "use_bias": true, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 7, "activity_regularizer": null, "name": "hidden3", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.0.5", "class_name": "Sequential"}