{"backend": "tensorflow", "keras_version": "2.0.5", "config": [{"config": {"bias_regularizer": null, "trainable": true, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 31], "activation": "relu", "units": 6, "use_bias": true, "dtype": "float32", "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "name": "hidden1"}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "trainable": true, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "relu", "units": 7, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "name": "hidden2"}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "trainable": true, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "softmax", "units": 7, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "name": "hidden3"}, "class_name": "Dense"}], "class_name": "Sequential"}