{"backend": "tensorflow", "config": [{"config": {"name": "hidden1", "batch_input_shape": [null, 31], "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_regularizer": null, "dtype": "float32", "kernel_constraint": null, "units": 6, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "hidden2", "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 7, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "hidden3", "activation": "softmax", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 7, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.0.5"}