{"keras_version": "2.0.5", "class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"trainable": true, "dtype": "float32", "kernel_regularizer": null, "units": 5, "batch_input_shape": [null, 3], "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "name": "hidden1"}}, {"class_name": "Dense", "config": {"trainable": true, "bias_regularizer": null, "activity_regularizer": null, "units": 4, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "name": "hidden2", "bias_constraint": null, "activation": "relu", "kernel_regularizer": null, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"trainable": true, "bias_regularizer": null, "activity_regularizer": null, "units": 3, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "name": "hidden3", "bias_constraint": null, "activation": "softmax", "kernel_regularizer": null, "kernel_constraint": null}}], "backend": "tensorflow"}