{"keras_version": "2.0.5", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "kernel_constraint": null, "activation": "relu", "trainable": true, "name": "hidden1", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "units": 5, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "batch_input_shape": [null, 3], "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "relu", "trainable": true, "name": "hidden2", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "units": 6, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "softmax", "trainable": true, "name": "hidden3", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "units": 5, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null}}]}